Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresDrawingsApplicationException Class
 The TeklaStructuresDrawingsApplicationException class defines the base class for all exceptions that can be thrown while using Tekla.Structures.Drawing.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 More...
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class TeklaStructuresDrawingsApplicationException : ApplicationException
<SerializableAttribute>
Public Class TeklaStructuresDrawingsApplicationException
	Inherits ApplicationException
The TeklaStructuresDrawingsApplicationException type exposes the following members.
Constructors
Name | Description
TeklaStructuresDrawingsApplicationException
 Creates a new exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotCreateSectionViewFrom3dView
 Tekla.Structures.Drawing.CannotDeleteActiveDrawingException
 Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToIncorrectTypeException
 Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToInexistantFieldException
 Tekla.Structures.Drawing.CannotGetAttributeForPluginException
 Tekla.Structures.Drawing.CannotInsertDrawingException
 Tekla.Structures.Drawing.CannotLoadAttributesException
 Tekla.Structures.Drawing.CannotModifyNonActiveDrawingException
 Tekla.Structures.Drawing.CannotPerformOperationDrawingEditorMustBeClosedException
 Tekla.Structures.Drawing.CannotPerformOperationDrawingIsActiveException
 Tekla.Structures.Drawing.CannotPerformOperationDrawingMustBeActiveException
 Tekla.Structures.Drawing.CannotPerformOperationDrawingNotUpToDateException
 Tekla.Structures.Drawing.CannotPerformOperationNumberingNotUpToDate
 Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToIncorrectTypeException
 Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToInexistantFieldException
 Tekla.Structures.Drawing.CannotSetAttributeForPluginException
 Tekla.Structures.Drawing.InvalidAttributesForOperationException
 Tekla.Structures.Drawing.InvalidPluginPickerInputException
 Tekla.Structures.Drawing.InvalidTypeException
 Tekla.Structures.Drawing.PickerInterruptedException